#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.github_actions_role.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::385569635049:oidc-provider/token.actions.githubusercontent.com]
module.route53.aws_route53_zone.public[0]: Refreshing state... [id=Z04346291XS3DUSULVREQ]
module.ssh_key.aws_key_pair.this: Refreshing state... [id=dev-ecoutu-key]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-07a4f4c7aecaf89b0]
module.iam.aws_iam_account_alias.alias[0]: Refreshing state... [id=ecoutu]
module.vpc.data.aws_availability_zones.available: Reading...
module.iam.aws_iam_policy.console_self_service: Refreshing state... [id=arn:aws:iam::385569635049:policy/ecoutu-console-self-service]
module.terraform_backend[0].aws_dynamodb_table.terraform_state_lock: Refreshing state... [id=ecoutu-terraform-stack-state-lock]
module.terraform_backend[0].aws_s3_bucket.terraform_state: Refreshing state... [id=ecoutu-terraform-stack-state]
module.iam.module.user_ecoutu.aws_iam_user.this: Refreshing state... [id=ecoutu]
data.aws_ami.packer_hardened_ubuntu: Reading...
module.iam.aws_iam_policy.enforce_mfa[0]: Refreshing state... [id=arn:aws:iam::385569635049:policy/ecoutu-enforce-mfa]
module.github_secrets.data.github_repository.this: Reading...
module.iam.module.user_ecoutu.aws_iam_user_login_profile.this[0]: Refreshing state... [id=ecoutu]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.iam.module.user_ecoutu.aws_iam_access_key.this[0]: Refreshing state... [id=AKIAVTRN5XLUVYADSFUS]
module.github_actions_role.data.aws_iam_policy_document.github_actions_assume_role: Reading...
module.github_actions_role.data.aws_iam_policy_document.github_actions_assume_role: Read complete after 0s [id=795156191]
module.iam.aws_iam_user_policy_attachment.console_self_service: Refreshing state... [id=ecoutu-20251114193444373700000001]
module.github_actions_role.aws_iam_role.github_actions: Refreshing state... [id=GitHubActionsTerraformRole]
module.iam.module.admin_role.data.aws_iam_policy_document.assume_role[0]: Reading...
module.iam.module.admin_role.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3606377518]
module.iam.module.admin_role.aws_iam_role.this: Refreshing state... [id=dev-admin-role]
module.iam.aws_iam_user_policy_attachment.enforce_mfa[0]: Refreshing state... [id=ecoutu-20251114201151476300000001]
data.aws_ami.packer_hardened_ubuntu: Read complete after 0s [id=ami-0184cef751e4c4dfd]
module.github_actions_role.aws_iam_role_policy.inline["TerraformDeployment"]: Refreshing state... [id=GitHubActionsTerraformRole:TerraformDeployment]
module.iam.module.admin_role.aws_iam_role_policy_attachment.managed_policies["arn:aws:iam::aws:policy/AdministratorAccess"]: Refreshing state... [id=dev-admin-role-20251114193453048900000002]
module.iam.aws_iam_policy.user_assume_admin: Refreshing state... [id=arn:aws:iam::385569635049:policy/ecoutu-assume-admin-role]
module.iam.module.admin_role.aws_iam_instance_profile.this[0]: Refreshing state... [id=dev-admin-role]
module.terraform_backend[0].aws_s3_bucket_policy.terraform_state: Refreshing state... [id=ecoutu-terraform-stack-state]
module.terraform_backend[0].aws_s3_bucket_server_side_encryption_configuration.terraform_state[0]: Refreshing state... [id=ecoutu-terraform-stack-state]
module.terraform_backend[0].aws_s3_bucket_public_access_block.terraform_state: Refreshing state... [id=ecoutu-terraform-stack-state]
module.terraform_backend[0].aws_s3_bucket_versioning.terraform_state: Refreshing state... [id=ecoutu-terraform-stack-state]
module.terraform_backend[0].aws_s3_bucket_lifecycle_configuration.terraform_state: Refreshing state... [id=ecoutu-terraform-stack-state]
module.github_secrets.data.github_repository.this: Read complete after 0s [id=terraform-stack]
module.github_secrets.github_actions_secret.additional["TF_VAR_github_token"]: Refreshing state... [id=terraform-stack:TF_VAR_github_token]
module.github_secrets.github_actions_secret.additional["PKR_VAR_ssh_public_key"]: Refreshing state... [id=terraform-stack:PKR_VAR_ssh_public_key]
module.github_secrets.github_actions_secret.aws_role_to_assume: Refreshing state... [id=terraform-stack:AWS_ROLE_TO_ASSUME]
module.github_secrets.github_actions_variable.additional["TF_VAR_environment"]: Refreshing state... [id=terraform-stack:TF_VAR_environment]
module.github_secrets.github_actions_variable.aws_region: Refreshing state... [id=terraform-stack:AWS_REGION]
module.github_secrets.github_actions_variable.additional["TF_VAR_aws_region"]: Refreshing state... [id=terraform-stack:TF_VAR_aws_region]
module.github_secrets.github_actions_variable.additional["TF_VAR_github_branches"]: Refreshing state... [id=terraform-stack:TF_VAR_github_branches]
module.github_secrets.github_actions_variable.additional["PKR_VAR_instance_type"]: Refreshing state... [id=terraform-stack:PKR_VAR_instance_type]
module.github_secrets.github_actions_variable.additional["TF_VAR_github_org"]: Refreshing state... [id=terraform-stack:TF_VAR_github_org]
module.github_secrets.github_actions_variable.additional["TF_VAR_terraform_state_bucket"]: Refreshing state... [id=terraform-stack:TF_VAR_terraform_state_bucket]
module.github_secrets.github_actions_variable.additional["TF_VAR_az_count"]: Refreshing state... [id=terraform-stack:TF_VAR_az_count]
module.github_secrets.github_actions_variable.additional["TF_VAR_enable_remote_state"]: Refreshing state... [id=terraform-stack:TF_VAR_enable_remote_state]
module.github_secrets.github_actions_variable.additional["TF_VAR_project_name"]: Refreshing state... [id=terraform-stack:TF_VAR_project_name]
module.github_secrets.github_actions_variable.additional["PKR_VAR_aws_region"]: Refreshing state... [id=terraform-stack:PKR_VAR_aws_region]
module.github_secrets.github_actions_variable.additional["TF_VAR_github_repo"]: Refreshing state... [id=terraform-stack:TF_VAR_github_repo]
module.github_secrets.github_actions_variable.additional["TF_VAR_vpc_cidr"]: Refreshing state... [id=terraform-stack:TF_VAR_vpc_cidr]
module.github_secrets.github_actions_variable.additional["TF_VAR_enable_nat_gateway"]: Refreshing state... [id=terraform-stack:TF_VAR_enable_nat_gateway]
module.github_secrets.github_actions_variable.additional["PKR_VAR_ami_name_prefix"]: Refreshing state... [id=terraform-stack:PKR_VAR_ami_name_prefix]
module.iam.aws_iam_user_policy_attachment.user_assume_admin: Refreshing state... [id=ecoutu-20251114193453575900000003]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-05873b0b86f0b3d90]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-04acc2cf83bb81383]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0588bec4faa528d07]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-033ac756e4f409217]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-047ef2a787a53ff13]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0c6567cd904f03b12]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-041bb33ee0f5cdddc]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-02b1cef271245381b]
module.minikube.aws_security_group.this: Refreshing state... [id=sg-0c33d7881ad7b7481]
module.route53.aws_route53_zone.private[0]: Refreshing state... [id=Z02085011UGQ3WHT60ZSS]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0f0ab5a227aafca55]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d842f397f187b1db]
module.minikube.aws_instance.this: Refreshing state... [id=i-06dcf2c3519b3067c]
module.vpc.aws_nat_gateway.main[1]: Refreshing state... [id=nat-0ca431a6bacf6f444]
module.vpc.aws_nat_gateway.main[0]: Refreshing state... [id=nat-063527dfa69e5869f]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06bb8e9e38465de33]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-04f9070ce070d18a2]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-06b3672797ee528ef]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-041bf8c9c59cc7868]
module.route53.aws_route53_record.private["minikube_private"]: Refreshing state... [id=Z02085011UGQ3WHT60ZSS_minikube.linklayer.ca_A]
module.route53.aws_route53_record.public["minikube_public"]: Refreshing state... [id=Z04346291XS3DUSULVREQ_minikube.linklayer.ca_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.github_secrets.github_actions_secret.additional["PKR_VAR_ssh_public_key"] must be replaced
-/+ resource "github_actions_secret" "additional" {
      ~ created_at       = "2025-11-18 19:26:42 +0000 UTC" -> (known after apply)
      ~ id               = "terraform-stack:PKR_VAR_ssh_public_key" -> (known after apply)
      - plaintext_value  = (sensitive value) -> null # forces replacement
      ~ updated_at       = "2025-11-18 19:26:42 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.minikube.aws_instance.this must be replaced
-/+ resource "aws_instance" "this" {
      ~ ami                                  = "ami-00b13f11600160c10" -> "ami-0184cef751e4c4dfd" # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-east-1:385569635049:instance/i-06dcf2c3519b3067c" -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-06dcf2c3519b3067c" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-03ffce662b858d6c6" -> (known after apply)
      ~ private_dns                          = "ip-10-0-0-187.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.0.187" -> (known after apply)
      ~ public_dns                           = "ec2-98-81-33-107.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "98.81.33.107" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Environment" = "dev"
            "Name"        = "dev-minikube"
            "Project"     = "linklayer"
            "Purpose"     = "Minikube Development"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
        # (10 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 3000 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ tags_all              = {
              - "Environment" = "dev"
              - "ManagedBy"   = "Terraform"
            } -> (known after apply)
          ~ throughput            = 125 -> (known after apply)
          ~ volume_id             = "vol-02a78292b08793a7d" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.route53.aws_route53_record.private["minikube_private"] will be updated in-place
  ~ resource "aws_route53_record" "private" {
        id                               = "Z02085011UGQ3WHT60ZSS_minikube.linklayer.ca_A"
        name                             = "minikube.linklayer.ca"
      ~ records                          = [
          - "10.0.0.187",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.route53.aws_route53_record.public["minikube_public"] will be updated in-place
  ~ resource "aws_route53_record" "public" {
        id                               = "Z04346291XS3DUSULVREQ_minikube.linklayer.ca_A"
        name                             = "minikube.linklayer.ca"
      ~ records                          = [
          - "98.81.33.107",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.ssh_key.aws_key_pair.this must be replaced
-/+ resource "aws_key_pair" "this" {
      ~ arn             = "arn:aws:ec2:us-east-1:385569635049:key-pair/dev-ecoutu-key" -> (known after apply)
      ~ fingerprint     = "a6:c9:61:55:11:38:9d:0b:f3:38:a8:52:0d:9f:41:26" -> (known after apply)
      ~ id              = "dev-ecoutu-key" -> (known after apply)
      + key_name_prefix = (known after apply)
      ~ key_pair_id     = "key-0fad652ac4ba9a9a9" -> (known after apply)
      ~ key_type        = "rsa" -> (known after apply)
      - public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDKv8m3jUvYaWiAJOCMLudYmZ6ig3ZVY/SfWo7PyAUdNZgZ9wO9NGAyjph66BRg1mlsXFfJF+9u1+P2hS2wZeZjzwSKIupdU8IkBwg+37nFe/lZwb6HJyRiz1Ll7diPIXOZ684t7o+sa6Sl4hqVt2xK7EdAGjMOn2cj1v5OKAaHj8zVHCQSLMbmFOONbYD+cyNz49pVVKnCYcdNjWJ2DtquKLDetUt1h69prd4h+xi4uXlaL/mV4nzjeONR6LkYzBFa/Bf454meGNJUavZNDPZ5jtxpkLy8eUzDo9i862P7oZRjEnHxOggG3NbbOVJpBZS4qFWAah+Djgw4MD7Lblzp1ltyb0xGOojHOo1pA9aLwjXcXmYNIy3Bmpa/qWARTJmUTbLTb/7HW1Kpd75Uc7TmUj9dwk54WgNXc9oEnR7RaJLr9jmtvss0FMB5ZyQfg+PyBwy1D3RzFBM4v40hZW0WBves23oXZLAn3BxifMpn14z/wLHGY4NHDYWGAbFGKXEBkAlobV//6JD6gecCQisrLajIKQNepkPk+jAc6zHBOiQZx3j2/jrm1IEnEO4RN48Px7Xa3dLDZn+m/3fEWoQKCkdwD4ymzXNBdsPCI26DSH/5cs7SEeQjTbtAz03KdsYsTfNKAZiH34kkvpNM03MaZLb2mWD9lukr3VJtmHk5vQ==" -> null # forces replacement
        tags            = {
            "Environment" = "dev"
            "Project"     = "linklayer"
            "Purpose"     = "SSH access to development instances"
        }
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 3 to destroy.

Changes to Outputs:
  ~ github_secrets_list              = (sensitive value)
  ~ github_variables_list            = (sensitive value)
  + minikube_ami_id                  = "ami-0184cef751e4c4dfd"
  + minikube_ami_name                = "ubuntu-hardened-ecoutu-20251118191658"
  ~ minikube_instance_id             = "i-06dcf2c3519b3067c" -> (known after apply)
  ~ minikube_private_ip              = "10.0.0.187" -> (known after apply)
  ~ minikube_public_dns              = "ec2-98-81-33-107.compute-1.amazonaws.com" -> (known after apply)
  ~ minikube_public_ip               = "98.81.33.107" -> (known after apply)
  ~ minikube_ssh_command             = "ssh -i ~/.ssh/id_rsa ecoutu@98.81.33.107" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @ecoutu, Action: `pull_request`*